# taps
tap 'dotenvx/brew' # import environment variables with ease
tap 'homebrew-ffmpeg/ffmpeg' # more full-featured ffmpeg than default formula
tap 'sass/sass' # Sassy CSS

# shell completions
brew 'bash-completion'
brew 'brew-cask-completion'
brew 'django-completion'
brew 'launchctl-completion'
brew 'open-completion'
brew 'pip-completion'
brew 'wp-cli-completion'
brew 'zsh-completions'

# formulae
brew 'ansible' # infrastructure as code tool
brew 'ansible-lint' # syntax checker for ansible
brew 'asciinema' # record and share terminal sessions, "the right way"
brew 'bitwarden-cli' # Bitwarden password manager terminal tool
brew 'btop' # system resource monitor for power users
brew 'caddy' # web server
brew 'cmatrix' # Matrix-like terminal waterfall
brew 'coreutils' # GNU coreutils
brew 'doctl' # DigitalOcean terminal tool
brew 'dotenvx/brew/dotenvx' # import environment variables with ease
brew 'exercism' # code education service
brew 'figlet' # Big ASCII words in terminal
brew 'flac' # open source audio codec
brew 'gh' # GitHub termainal tool
brew 'git' # revision control tool
brew 'go' # programming language
brew 'highlight' # universal sourcecode to formatted text converter
brew 'homebrew-ffmpeg/ffmpeg/ffmpeg' # Swiss Army knife for AV
brew 'htop' # system resource monitor
brew 'httm' # interactive, file-level Time Machine-like tool for ZFS/Btrfs
brew 'iperf3' # network latency testing tool
brew 'jq' # Query tool for JSON data
brew 'keychain' # user-friendly front-end to ssh-agent(1)
brew 'lolcat' # rainbows and unicorns in your terminal!
brew 'magic-wormhole' # get a file from here to there from the terminal with ease
brew 'markdown' # lightweight markup language that converts well to HTML
brew 'mas' # App Store terminal tool
brew 'mysql-client@8.0' # access MySQL/MariaDB databases
brew 'nmap' # network tool
brew 'openssh' # secure shell to remote systems
brew 'opentofu' # open source infrastructure as code tool
brew 'osxutils' # collection of macOS terminal tools
brew 'pyenv' # manage Python versions and packages
brew 'python-setuptools' # easily download, build, install and remove Python packages
brew 'python@3.12' # programming language
brew 'qrencode' # generate QR codes
brew 'restic' # backup tool
brew 'rsync' # send and receive files between folders or machines
brew 'sass/sass/sass' # Sassy CSS stylesheet preprocessor
brew 'screen' # terminal mutiplexer (terminals inside terminals)
brew 'sqlite' # lightweight database-like thing
brew 'theora' # open source audio codec
brew 'tree' # list directory trees
brew 'vim' # text editor for the terminal
brew 'webp' # image format support
brew 'wget' # HTTP terminal tool
brew 'wp-cli' # WordPress terminal tool
brew 'xvid' # AV codec
brew 'yamllint' # syntax checker for YAML files
brew 'zsh-syntax-highlighting' # make the terminal pretty
brew 'zstd' # fast and modern compression algorithm

# cask fonts
cask 'font-anonymous-pro'
cask 'font-bebas-neue'
cask 'font-cantarell'
cask 'font-cascadia-code'
cask 'font-cousine'
cask 'font-droid-sans-mono-nerd-font'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fjalla-one'
cask 'font-great-vibes'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-hackgen'
cask 'font-hackgen-nerd'
cask 'font-ibm-plex-mono'
cask 'font-ibm-plex-sans'
cask 'font-inconsolata'
cask 'font-lato'
cask 'font-libre-barcode-39'
cask 'font-libre-barcode-39-extended'
cask 'font-libre-barcode-39-extended-text'
cask 'font-lobster'
cask 'font-lobster-two'
cask 'font-mononoki'
cask 'font-montserrat'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'
cask 'font-noto-mono'
cask 'font-noto-sans'
cask 'font-noto-sans-mono'
cask 'font-noto-sans-symbols'
cask 'font-noto-sans-symbols-2'
cask 'font-open-sans'
cask 'font-oswald'
cask 'font-pacifico'
cask 'font-poppins'
cask 'font-powerline-symbols'
cask 'font-rajdhani'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-sf-mono'
cask 'font-sf-pro'
cask 'font-source-code-pro'
cask 'font-source-serif-4'
cask 'font-ubuntu'
cask 'font-ubuntu-condensed'
cask 'font-ubuntu-mono'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-ubuntu-nerd-font'

# cask apps
cask '1password' # password manager
cask '1password-cli' # 1Password terminal tool
cask 'appzapper' # uninstall apps more completely than just dragging them to the Trash
cask 'autodesk-fusion' # CAD/CAM
cask 'balenaetcher' # burn disk images to USB thumb drives
cask 'bricklink-studio' # build, render and create LEGO instructions
cask 'canva' # graphic design tool
cask 'chromium' # web browser (Chrome minus Google)
cask 'db-browser-for-sqlite' # browse SQLite databases
cask 'discord' # chat and game
cask 'firefox' # open source web browser
cask 'google-chrome' # web browser that spies on your every move
cask 'gpg-suite' # manage GNU Privacy Guard keys, signatures, etc.
cask 'imageoptim' # photo metadata scrubber and compression app
cask 'inkscape' # graphic design tool
cask 'iterm2' # better terminal than Terminal.app
cask 'kdenlive' # video editor
cask 'keka' # multi-format decompression app
cask 'krita' # graphic design app
cask 'launchcontrol' # GUI for launchd
cask 'libreoffice' # open source office suite
cask 'microsoft-auto-update' # keep Microsoft apps up to date
cask 'microsoft-edge' # web browser based on Chrome
cask 'microsoft-office' # office suite
cask 'mkvtoolnix' # Matroshka video file tool
cask 'mullvad-browser' # web browser
cask 'mullvadvpn' # VPN provider
cask 'musicbrainz-picard' # Music metadata app
cask 'mysqlworkbench' # browse and manage MySQL/MariaDB databases
cask 'namechanger' # bulk-rename app
cask 'omnifocus' # task manager
cask 'openscad' # CAD programming language and renderer
cask 'plexamp' # audio player for Plex
cask 'processing' # visualization programming language
cask 'prusaslicer' # 3D model slicing app
cask 'qlcolorcode' # Quick Look plugin - renders source code with formatting
cask 'qlcommonmark' # Quick Look plugin for Markdown files
cask 'qlmarkdown' # Quick Look plugin for Markdown files
cask 'qlvideo' # Quick Look plugin - thumbnails, static previews, cover art and metadata for video files
cask 'qlzipinfo' # Quick Look plugin for ZIP files
cask 'quicklook-csv' # Quick Look plugin for CSV files
cask 'quicklook-json' # Quick Look plugin for JSON files
cask 'selfcontrol' # block sites using /etc/hosts and a timer
cask 'sf-symbols' # Apple font extras
cask 'shift' # separate work and personal accounts
cask 'sourcetree' # open source revision control app
cask 'steam' # games platform
cask 'sublime-text' # text editor
cask 'superduper' # backup app
cask 'syncthing' # open source file sync tool
cask 'tailscale' # virtual private network app
cask 'tower' # Git GUI app
cask 'transmission-remote-gui' # manage torrents on another machine
cask 'transmit' # SFTP app
cask 'ubiquiti-unifi-controller' # UniFi management app
cask 'ultimaker-cura' # 3D model slicer
cask 'virtualbox' # virtualization hypervisor app
cask 'visual-studio-code' # text editor
cask 'vivaldi' # web browser
cask 'vlc' # VideoLan AV player
cask 'vnc-viewer' # connect to remote VNC sessions
cask 'wireshark' # network traffic monitoring app
cask 'zed' # text edior
cask 'zoom' # videoconferencing app
cask 'zotero' # citation management app

# App Store apps
mas '1Password for Safari', id: 1569813296
mas 'Bitwarden', id: 1352778147
mas 'Developer', id: 640199958
mas 'Equinox', id: 1591510203
mas 'FileBot', id: 905384638
mas 'FileShredder', id: 418094085
mas 'Full Deck Solitaire', id: 412980789
mas 'GarageBand', id: 682658836
mas 'GrandPerspective', id: 1111570163
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Music Tag Edit', id: 999242964
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Simple Comic', id: 1497435571
mas 'Text Workflow: Text Converter', id: 1600520682
mas 'Windows App', id: 1295203466
mas 'Xcode', id: 497799835
mas 'xScope', id: 447661441

# Visual Studio Code extensions
vscode 'ecmel.vscode-html-css'
vscode 'kevinrose.vsc-python-indent'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-python.python'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'redhat.vscode-yaml'
vscode 'vscode-icons-team.vscode-icons'
vscode 'wholroyd.jinja'
vscode 'yzhang.markdown-all-in-one'
